import React from "react";
import {Card, CardBody, Heading, Stack, Text, Image} from "@chakra-ui/react";
import avatar from "../../assets/photo_2024-02-18_21-09-50.jpg";

export const BiographyPage: React.FC = () => {
    return (
        <>
            <Card
                direction={{ base: 'column', sm: 'row' }}
                overflow='hidden'
                variant='outline'
            >
                <Image
                    objectFit='cover'
                    maxW={{ base: '100%', sm: '200px' }}
                    src={avatar}
                    alt='Caffe Latte'
                />

                <Stack>
                    <CardBody>
                        <Heading size='md'>Бенчук Алеся</Heading>

                        <Text py='2'>
                            Бенчук Алеся, родившаяся и выросшая в технологическом центре Беларуси, городе Гомеле, с самого детства проявляла глубокий интерес к информационным технологиям. В школьные годы она активно участвовала в кружках по программированию и математических олимпиадах, что закрепило её стремление к точным наукам.

                            После успешного окончания школы, Алеся поступила в колледж, а потом в Гомельский университет имени Франциско Скорины. Уже после колледжа она начала работать 1С программистом в местной IT-компании, что позволило ей совмещать теоретические знания с практическими навыками.

                            Её работа заключается в разработке и поддержке программного обеспечения на платформе 1С для автоматизации бизнес-процессов клиентов. Алеся проявила себя как ценный сотрудник, способный быстро решать сложные задачи и адаптироваться к новым условиям работы, благодаря чему она быстро продвигалась по карьерной лестнице.
                        </Text>
                    </CardBody>
                </Stack>
            </Card>
        </>
    )
}