import React from "react";
import "./index.css";

export const IndexPage: React.FC = () => {

    return (
        <>
            <p>Официальной датой создания Гомельского государственного педагогического института является решение СНК и
                Экономического Совещания БССР от 21 июня 1930 года.
                В пединституте были организованы два отделения: физико-математическое и химико-биоло­гичес­кое. В 1935
                году был открыт факультет литературы и языка. 5 марта 1939
                года вузу было присвоено имя В.П. Чкалова. В 1940 году был построен первый учебный корпус.</p>
            <p>1 мая 1969 года на базе пединститута был открыт Гомельский государственный университет в составе
                историко-филологического, механико-математического,
                физического, биолого-почвенного, физического воспитания, геологического, экономического факультетов.
                Пер­вым ректором стал учёный-физик, академик В.А. Белый. </p>
            <p>В августе 1973 года ректором ГГУ был назначен известный учёный-физик, академик, участ­­ник Великой
                Отечественной войны Б.В. Бокуть.
                За годы работы в университете академиком Б.В. Бокутем была создана научная школа по оптике, которая
                получила известность далеко за пределами республики.</p>
            <p>Постановлением Совета Министров БССР от 29 ноября 1988 года за вклад в научное исследование наследия
                крупнейшего гуманиста эпохи Возрождения, восточнославянского и
                белорусского первопечатника Франциска Скорины, истории и культуры белорусского народа Гомельскому
                государственному университету было присвоено имя Франциска Скорины.</p>
            <p>19 сентября 1989 года на расширенном заседании Совета университета ректором был избран член-корреспондент
                НАН Беларуси Л.А. Шеметков – известный математик, создатель научной
                математической школы. В начале ХХI века университет возглавляли док­тор фи­зи­ко-математических наук,
                профессор М.В. Селькин, доктор химических наук, профессор, член-корреспондент
                НАН Беларуси А.В. Рогачёв.</p>
        </>

    )
}